# -*- coding: utf-8 -*-

REBORN = """\n\tВы не успели найти выход!!! Вода быстро заполняет всё окружающее пространство!!
У вас темнеет в глазах... Дышать нечем... Вода заполняет ваши легкие... Вы понимаете, что это конец вашего приключения.
\tНо что это?! Вы очнулись у входа в пещеру... Оберег подаренный матушкой 
излучает приятное тепло. Вы не понимаете как такое возможно. Вы снова стоите у входа в подземелье и 
на этот раз вам не стерпимо хочется убежать подальше от этого проклятого места, но чувство долга перед 
жителями окрестных деревень останавливает вас.."""

BACKSTORY = """\n\tПодземелье было выкопано ящеро-подобными монстрами рядом с аномальной рекой,
постоянно выходящей из берегов. Из-за этого подземелье регулярно затапливается, 
монстры выживают, но не герои, рискнувшие спуститься к ним в поисках приключений.
Почуяв безнаказанность, ящеры начали совершать набеги на ближайшие деревни. 
На защиту всех деревень не хватило солдат и вас, как известного в этих краях героя, 
наняли для их спасения.\n\tВы стоите перед входом в подземелье, вы чувствуете тревогу и, сжав в руке подаренный матушкой 
талисман, боретесь с нахлынувшим чувством..."""
